$ETL$

In [70]:
# importar librerias necesarias
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

### Leer Datos

In [82]:
# Leer datos desde csv en dataframe de pandas
encoding = "utf8"
canalDeVenta = pd.read_csv("..\datos\CanalDeVenta.csv", sep=",", encoding=encoding)
clientes = pd.read_csv("..\datos\Clientes.csv", sep=";", encoding=encoding, usecols=['ID','Provincia', 'Nombre_y_Apellido', 'Domicilio', 'Telefono'])
compras = pd.read_csv("..\datos\Compra.csv", sep=",", encoding=encoding)
empleados = pd.read_csv("..\datos\Empleados.csv", sep=",", encoding=encoding)
gasto = pd.read_csv("..\datos\Gasto.csv", sep=",", encoding=encoding)
productos = pd.read_csv("..\datos\Productos.csv", sep=",", encoding=encoding)
proveedores = pd.read_csv("..\datos\Proveedores.csv", sep=",", encoding=encoding)
sucursales = pd.read_csv("..\datos\Sucursales.csv", sep=";",encoding=encoding, usecols=['ID','Sucursal','Direccion','Localidad','Provincia'])
tipoDeGasto = pd.read_csv("..\datos\TiposDeGasto.csv", sep=",", encoding=encoding)
venta = pd.read_csv("..\datos\Venta.csv", sep=",", encoding=encoding)

### Analizar Datos

In [83]:
canalDeVenta.head()

   CODIGO DESCRIPCION
0       1  Telefónica
1       2      OnLine
2       3  Presencial

In [86]:
canalDeVenta['DESCRIPCION'] = canalDeVenta['DESCRIPCION'].astype(str)

In [84]:
canalDeVenta.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   CODIGO       3 non-null      int64
 1   DESCRIPCION  3 non-null      object
dtypes: int64(1), object(1)
memory usage: 180.0+ bytes

In [85]:
canalDeVenta.describe()

       CODIGO
count     3.0
mean      2.0
std       1.0
min       1.0
25%       1.5
50%       2.0
75%       2.5
max       3.0

In [112]:
# cambiar el tipo de dato a str de la columna telefono y eliminar el separador
clientes['Telefono'] = clientes['Telefono'].astype(str).str.replace('-','')

In [113]:
clientes.head()

,ID,Provincia,Nombre_y_Apellido,Domicilio,Telefono
0,1,Buenos Aires,HEBER JONI SANTANA,LAS HERAS Y BAT. 24 DE FEBRERO 4150 RINCON DE...,425161
1,2,Buenos Aires,ANA SAPRIZA,PUEYRREDON Y DUPUY RUTA3 KM 52.500 S/N BÂº LO...,497578
2,3,Buenos Aires,FERNANDO LUIS SARALEGUI,CALDERON DE LA BARCA 498,493435
3,4,Buenos Aires,MANUELA SARASOLA,"RUTA 36 KM 45,500 S/N EL PELIGRO",492883
4,5,Buenos Aires,MARIO RAÚL SARASUA,492 Y 186 S/N COLONIA URQUIZA,4914608

In [114]:
clientes.describe()

                ID
count  3407.000000
mean   1704.000000
std     983.660511
min       1.000000
25%     852.500000
50%    1704.000000
75%    2555.500000
max    3407.000000

In [115]:
clientes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3407 entries, 0 to 3406
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   ID                 3407 non-null   int64
 1   Provincia          3376 non-null   object
 2   Nombre_y_Apellido  3361 non-null   object
 3   Domicilio          3359 non-null   object
 4   Telefono           3407 non-null   object
dtypes: int64(1), object(4)
memory usage: 133.2+ KB

In [80]:
compras.head()

   IdCompra       Fecha  IdProducto  Cantidad  Precio  IdProveedor
0         1  2015-01-30       42832        13  560.51           12
1         2  2015-01-30       42833        11  497.58            7
2         3  2015-01-30       42834         1  588.50            6
3         4  2015-01-30       42835         9  567.66           14
4         5  2015-01-30       42839        14  231.31            2

In [81]:
sucursales.head()

,ID,Sucursal,Direccion,Localidad,Provincia
0,1,Cabildo,Av. Cabildo 1342,Ciudad de Buenos Aires,Ciudad de Buenos Aires
1,2,Palermo 1,Guatemala 5701,CABA,CABA
2,3,Palermo 2,Gral. Lucio Norberto Mansilla 2668,CABA,C deBuenos Aires
3,4,Corrientes,Av. Corrientes 2352,Ciudad de Buenos Aires,Bs As
4,5,Almagro,Venezuela 3650,Capital,Bs.As.